#+title: Convergence of distribution functions, empirical distributions.
#+author: Nicky D. van Foreest

#+STARTUP: indent
#+STARTUP: showall
#+PROPERTY: header-args:shell :exports both
#+PROPERTY: header-args:emacs-lisp :eval no-export
#+PROPERTY: header-args:python :eval no-export
# +PROPERTY: header-args:python :session  :exports both   :dir "./figures/" :results output

#+OPTIONS: toc:nil author:nil date:nil title:t

#+LATEX_CLASS: subfiles
#+LATEX_CLASS_OPTIONS: [assignments]

#+begin_src emacs-lisp :exports results :results none :eval export
  (make-variable-buffer-local 'org-latex-title-command)
  (setq org-latex-title-command (concat "\\chapter{%t}\n"))
#+end_src

** First naive idea

Given a set of measurements $x_{1}, \ldots, x_n$, the empirical CDF is defined as
\begin{align*}
F(x) = \frac{1}{n}\sum_{i=1}^n \1{x_i \leq x}
\end{align*}
This is a clean mathematical definition, but as if often the case with mathematical definitions, you should stay clear from using it to /compute/ the CDF: the numerical performance is absolutely terrible.


#+begin_src python
x = [2, 5, 2, 1, 8, 5, 5]

def F(y):
    tot = 0
    for xi in x:
        tot += xi <= y # this

    return  tot/len(x)

print(F(5.5))
#+end_src

#+RESULTS:
: 0.875

#+begin_exercise
Explain first how the ~this~ line works.
#+begin_hint
Run this code to see what happens
#+begin_src python
print(3 < 4)
jj = 0
jj += 3 < 4
print(jj)
#+end_src
#+end_hint
#+end_exercise

#+begin_exercise
Explain in your own words why this way to compute the empirical CDF is a not so smart (i.e., pretty dumb) idea.
#+begin_hint
How many comparisons are required for each value of $F(y)$?
#+end_exercise

** A better idea

#+begin_src python
print(sorted(x))
#+end_src

#+RESULTS:
: [1, 2, 5, 8]


#+begin_src python
plt.clf()
plt.plot(sorted(x))
plt.savefig("emp00.pdf")
#+end_src

#+begin_src python :results value file :exports results
"emp00.pdf"
#+end_src

#+RESULTS:
[[file:figures/emp00.pdf]]



** Yet better idea

#+begin_src python
def cdf_better(x):
    x = sorted(x)
    n = len(x)
    y = range(1, n + 1)
    y = [z / n for z in y]  # normalize
    return x, y


x = [2, 5, 2, 1, 8, 5, 5]
x, F = cdf_better(x)
print(F)
#+end_src

#+RESULTS:
| 0.14285714285714285 | 0.2857142857142857 | 0.42857142857142855 | 0.5714285714285714 | 0.7142857142857143 | 0.8571428571428571 | 1.0 |

#+begin_exercise
Why do we divide by $n$ to normalize?
#+end_exercise

You should know that ~for~ loops in R and python are quite slow. We use this in the list comprehension in the line in which we ~#normalize~.
For larger amounts of data it is better to use =numpy=. This we do below.


** Faster with numpy

#+begin_src python
import numpy as np

def cdf(x):
    y = np.arange(1, len(x) + 1) / len(x)
    x = np.sort(x)
    return x, y

x = [2, 5, 2, 1, 8, 5, 5]
x, F = cdf(x)
print(F)
#+end_src

#+RESULTS:
| 0.14285714 | 0.28571429 | 0.42857143 | 0.57142857 | 0.71428571 | 0.85714286 | 1 |

** Remove duplicate values

Finally, we can make the computation of the cdf significantly faster with using the following numpy functions.

#+begin_src python
unique, count = np.unique(np.sort(x), return_counts=True)
print(unique, count)
#+end_src

#+RESULTS:
| array | ((1 2 5 8)) | array | ((1 2 3 1)) |

#+begin_exercise
Explain what ~np.unique~ does and how this improves the speed of the computation of the ECDF (empirical CDF). What happens if you forget to sort the input ~x~?
#+end_exercise


#+begin_src python
print(count.cumsum()/7)
#+end_src

#+RESULTS:
| 0.14285714 | 0.42857143 | 0.85714286 | 1 |

#+begin_exercise
What is ~cumsum~?
#+end_exercise

#+begin_src python
def cdf_fastest(x):
    # remove multiple occurences of the same value
    unique, count = np.unique(x, return_counts=True)
    x = unique
    y = count.cumsum() / count.sum()
    return x, y

x = [2, 5, 2, 1, 8, 5, 5]
x, F = cdf_fastest(x)
print(F)
#+end_src

#+RESULTS:
| 0.14285714 | 0.42857143 | 0.85714286 | 1 |

#+begin_exercise
Find the CDF for arrival times [2,5,7,8,9,10] and plot it.
#+end_exercise


#+begin_exercise
Explain what  the Kolmogorov-Smirnov test has to do with the ECDF; search on the web for this. Keep your discussion short, but to the point.
#+end_exercise
